## Problem 0 - Part 3

In Pandas the main object is a DataFrame. A DataFrame is a dictionary that is used here where keys get converted to column names and values to row values. As you will notice, this is the main difference with Numpy's Arrays.

In [2]:
#Let's import pandas and create a dataframe. 
import pandas as pd

data = pd.DataFrame({'Country': ['Russia','Colombia','Chile','Equador','Nigeria'],
                    'Rank':[121,40,100,130,11]})
data

    Country  Rank
0    Russia   121
1  Colombia    40
2     Chile   100
3   Equador   130
4   Nigeria    11

As you can see, `data` is inserted into a table and headers are highlighted. Let's see what happens when we print `data`...

In [3]:
print(data)

Country  Rank
0    Russia   121
1  Colombia    40
2     Chile   100
3   Equador   130
4   Nigeria    11

Another important feature from Pandas, is to provide [descriptive statistics](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html) easy. Descriptive statistics include those that summarize the central tendency, dispersion and shape of a datasetâ€™s distribution, excluding NaN values.

In [4]:
data.describe()

             Rank
count    5.000000
mean    80.400000
std     52.300096
min     11.000000
25%     40.000000
50%    100.000000
75%    121.000000
max    130.000000

Remember, `describe()`method computes summary statistics of integer / double variables. To get the complete information about the data set, we can use info() function.

In [5]:
# With the `info()` function you can explore the file structure and size
# Among other things, it shows the data set has 5 rows and 2 columns 
# with their respective names.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  5 non-null      object
 1   Rank     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

Let's create another data frame.

In [6]:
data = pd.DataFrame({'group':['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [7]:
#Let's sort the data frame by ounces - inplace = True will make changes to the data
data.sort_values(by=['ounces'],ascending=True,inplace=False)

  group  ounces
1     a     3.0
6     c     3.0
0     a     4.0
7     c     5.0
3     b     6.0
8     c     6.0
4     b     7.5
5     b     8.0
2     a    12.0

In [8]:
#We can sort the data by not just one column but multiple columns as well.
data.sort_values(by=['group','ounces'],ascending=[True,False],inplace=False)

  group  ounces
2     a    12.0
0     a     4.0
1     a     3.0
5     b     8.0
4     b     7.5
3     b     6.0
8     c     6.0
7     c     5.0
6     c     3.0

Often, we get data sets with duplicate rows, which is nothing but noise. Therefore, before training the model, we need to make sure we get rid of such inconsistencies in the data set. Let's see how we can remove duplicate rows.

In [9]:
#create another data with duplicated rows
data = pd.DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [10]:
#sort values 
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [11]:
#remove duplicates - ta da! 
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

Here, we removed duplicates based on matching row values across all columns. Alternatively, we can also remove duplicates based on a particular column. Let's remove duplicate values from the k1 column.

In [12]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

Now, we will learn to categorize rows based on a predefined criteria. It happens a lot while data processing where you need to categorize a variable. For example, say we have got a column with country names and we want to create a new variable 'continent' based on these country names. In such situations, we will require the steps below:

In [14]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Now, we want to create a new variable which indicates the type of animal which acts as the source of the food. To do that, first we'll create a dictionary to map the food to the animals. Then, we'll use map function to map the dictionary's values to the keys. Let's see how is it done.

In [16]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

def meat_2_animal(series):
    if series['food'] == 'bacon':
        return 'pig'
    elif series['food'] == 'pulled pork':
        return 'pig'
    elif series['food'] == 'pastrami':
        return 'cow'
    elif series['food'] == 'corned beef':
        return 'cow'
    elif series['food'] == 'honey ham':
        return 'pig'
    else:
        return 'salmon'


#create a new variable
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [17]:
#another way of doing it is: convert the food values to the lower case and apply the function
lower = lambda x: x.lower()
data['food'] = data['food'].apply(lower)
data['animal2'] = data.apply(meat_2_animal, axis='columns')
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

Another way to create a new variable is by using the assign function. With this tutorial, as you keep discovering the new functions, you'll realize how powerful pandas is.

In [18]:
data.assign(new_variable = data['ounces']*10)

          food  ounces  animal animal2  new_variable
0        bacon     4.0     pig     pig          40.0
1  pulled pork     3.0     pig     pig          30.0
2        bacon    12.0     pig     pig         120.0
3     pastrami     6.0     cow     cow          60.0
4  corned beef     7.5     cow     cow          75.0
5        bacon     8.0     pig     pig          80.0
6     pastrami     3.0     cow     cow          30.0
7    honey ham     5.0     pig     pig          50.0
8     nova lox     6.0  salmon  salmon          60.0

In [19]:
data.drop('animal2',axis='columns',inplace=True)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We frequently find missing values in our data set. A quick method for imputing missing values is by filling the missing value with any random number. Not just missing values, you may find lots of outliers in your data set, which might require replacing. Let's see how can we replace values.

In [20]:
#Series function from pandas are used to create arrays
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [21]:
# we will need numpy to create a NaN value. As you will see, numpy and pandas are good complementing each others
import numpy as np

#replace -999 with NaN values
data.replace(-999, np.nan,inplace=True)
data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [22]:
#We can also replace multiple values at once.
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data.replace([-999,-1000],np.nan,inplace=True)
data

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

### Columns and string values 

Now, let's learn how to rename column names and axis (row names).

In [23]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [24]:
#Using rename function
data.rename(index = {'Ohio':'SanF'}, columns={'one':'one_p','two':'two_p'},inplace=True)
data

          one_p  two_p  three  four
SanF          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

In [40]:
#You can also use string functions
data.rename(index = str.upper, columns=str.title,inplace=True)
data

          One_P  Two_P  Three  Four
SANF          0      1      2     3
COLORADO      4      5      6     7
NEW YORK      8      9     10    11

### Groups and categories
Next, we'll learn to categorize (bin) continuous variables.

In [25]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

We'll divide the ages into bins such as 18-25, 26-35,36-60 and 60 and above.

In [26]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Understand the output - '(' means the value is included in the bin, '[' means the value is excluded

In [27]:
#To include the right bin value, we can do:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [28]:
#Let's check how many observations fall under each bin
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [29]:
#Also, we can pass a unique name to each label.

bin_names = ['Youth', 'YoungAdult', 'MiddleAge', 'Senior']
new_cats = pd.cut(ages, bins,labels=bin_names)

pd.value_counts(new_cats)

Youth         5
MiddleAge     3
YoungAdult    3
Senior        1
dtype: int64

In [30]:
#we can also calculate their cumulative sum
pd.value_counts(new_cats).cumsum()

Youth          5
MiddleAge      8
YoungAdult    11
Senior        12
dtype: int64

Let's proceed and learn about grouping data and creating pivots in pandas. It's an immensely important data analysis method which you'd probably have to use on every data set you work with.

In [31]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.860204  0.990551
1    a  two -0.258732  0.833380
2    b  one  1.663025  1.775972
3    b  two  1.543391  0.274352
4    a  one  1.095573  2.470395

In [32]:
#calculate the mean of data1 column by key1
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    0.565682
b    1.603208
Name: data1, dtype: float64

In [33]:
#slice the dataframe
dates = pd.date_range('20130101',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.638948  0.970080  0.345326 -0.478046
2013-01-02 -2.076169  0.728647  0.861332 -1.189225
2013-01-03  1.366898 -1.078847 -1.994052 -2.265396
2013-01-04 -1.127606 -0.791030  0.389862 -0.141266
2013-01-05  0.332704 -0.648000 -1.084814  1.474950
2013-01-06  0.134951  0.457958  2.267651  1.133680

In [34]:
#get first n rows from the data frame
df[:3]

                   A         B         C         D
2013-01-01  0.638948  0.970080  0.345326 -0.478046
2013-01-02 -2.076169  0.728647  0.861332 -1.189225
2013-01-03  1.366898 -1.078847 -1.994052 -2.265396

In [35]:
#slice based on date range
df['20130101':'20130104']

                   A         B         C         D
2013-01-01  0.638948  0.970080  0.345326 -0.478046
2013-01-02 -2.076169  0.728647  0.861332 -1.189225
2013-01-03  1.366898 -1.078847 -1.994052 -2.265396
2013-01-04 -1.127606 -0.791030  0.389862 -0.141266

In [37]:
#slicing based on column names
df.loc[:,['A','C']]

                   A         C
2013-01-01  0.638948  0.345326
2013-01-02 -2.076169  0.861332
2013-01-03  1.366898 -1.994052
2013-01-04 -1.127606  0.389862
2013-01-05  0.332704 -1.084814
2013-01-06  0.134951  2.267651

In [38]:
#slicing based on both row index labels and column names
df.loc['20130102':'20130103',['A','B']]

                   A         B
2013-01-02 -2.076169  0.728647
2013-01-03  1.366898 -1.078847

In [39]:
#slicing based on index of columns
df.iloc[3] #returns 4th row (index is 3rd)

A   -1.127606
B   -0.791030
C    0.389862
D   -0.141266
Name: 2013-01-04 00:00:00, dtype: float64

In [40]:
#returns a specific range of rows
df.iloc[2:4, 0:2]

                   A         B
2013-01-03  1.366898 -1.078847
2013-01-04 -1.127606 -0.791030

In [41]:
#returns specific rows and columns using lists containing columns or row indexes
df.iloc[[1,5],[0,2]]

                   A         C
2013-01-02 -2.076169  0.861332
2013-01-06  0.134951  2.267651

Similarly, we can do Boolean indexing based on column values as well. This helps in filtering a data set based on a pre-defined condition.

In [42]:
df[df.A > 1]

                   A         B         C         D
2013-01-03  1.366898 -1.078847 -1.994052 -2.265396

In [43]:
#we can copy the data set
df2 = df.copy()
df2['E']=['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.638948  0.970080  0.345326 -0.478046    one
2013-01-02 -2.076169  0.728647  0.861332 -1.189225    one
2013-01-03  1.366898 -1.078847 -1.994052 -2.265396    two
2013-01-04 -1.127606 -0.791030  0.389862 -0.141266  three
2013-01-05  0.332704 -0.648000 -1.084814  1.474950   four
2013-01-06  0.134951  0.457958  2.267651  1.133680  three

In [44]:
#select rows based on column values
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.366898 -1.078847 -1.994052 -2.265396   two
2013-01-05  0.332704 -0.648000 -1.084814  1.474950  four

In [45]:
#select all rows except those with two and four
df2[~df2['E'].isin(['two','four'])]

                   A         B         C         D      E
2013-01-01  0.638948  0.970080  0.345326 -0.478046    one
2013-01-02 -2.076169  0.728647  0.861332 -1.189225    one
2013-01-04 -1.127606 -0.791030  0.389862 -0.141266  three
2013-01-06  0.134951  0.457958  2.267651  1.133680  three

In [46]:
#list all columns where A is smaller than B OR C
df.query('A < B | C > A')

                   A         B         C         D
2013-01-01  0.638948  0.970080  0.345326 -0.478046
2013-01-02 -2.076169  0.728647  0.861332 -1.189225
2013-01-04 -1.127606 -0.791030  0.389862 -0.141266
2013-01-06  0.134951  0.457958  2.267651  1.133680

### From DataFrames to Numpy's Arrays
You may ask how to move from pandas to numpy. We just use `to_numpy()` functions.

In [47]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['a', 'b', 'c'])
df

   A  B
a  1  4
b  2  5
c  3  6

In [48]:
df.to_numpy()

array([[1, 4],
       [2, 5],
       [3, 6]], dtype=int64)

By default, a view is returned, so any modifications made will affect the original.

In [49]:
v = df.to_numpy()
v[0, 0] = -1
df

   A  B
a -1  4
b  2  5
c  3  6

If you need a copy instead, use `to_numpy(copy=True);`

In [50]:
v = df.to_numpy(copy=True)
v[0, 0] = -123
df

   A  B
a -1  4
b  2  5
c  3  6

If you need to Preserve the `dtype` you can use `np.rec.fromrecord` (you can also use pandas' `to_records()` but has proven less efficient):

In [51]:
v = df.reset_index()
np.rec.fromrecords(v, names=v.columns.tolist())

rec.array([('a', -1, 4), ('b',  2, 5), ('c',  3, 6)],
          dtype=[('index', '<U1'), ('A', '<i4'), ('B', '<i4')])

Up till now, we've become familiar with the basics of pandas library using toy examples. Now, we'll take up a real-life data set and use our newly gained knowledge to explore it. Close this Notebook and let's go to the part 4!